//
//  Constants.swift
//  Registrator
//
//  Created by Руслан Сафаргалеев on 24.07.2020.
//  Copyright © 2020 Руслан Сафаргалеев. All rights reserved.
//

import Foundation

struct Constants {
    static let sex = "Пол: "
    static let tax = "Система нологообложения: "
    static let taxRate = "Ставка налогообложения: "
    static let genders = ["", "Мужской", "Женский"]
    static let passportDate = "Дата выдачи: "
    static let dateOfBirth = "Дата рождения: "
    static let phoneNumber = "Номер телефона: "
    static let helpText = "Добро пожаловать в мастер подготовки документов для регистарции ИП"
    static let taxes = ["", "Общая система налогообложения (ОСНО)", "Упрощенная система налогообложения (УСН)"]
    static let taxesRate = ["", "Доходы (6% от всех доходов)", "Доходы минус расходы (от 5% до 15%)"]
    
    static let okvedClasses = [
        ["01", "Растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях"],
        ["02", "Лесоводство и лесозаготовки"],
        ["03", "Рыболовство и рыбоводство"],
        ["05", "Добыча угля"],
        ["06", "Добыча нефти и природного газа"],
        ["07", "Добыча металлических руд"],
        ["08", "Добыча прочих полезных ископаемых"],
        ["09", "Предоставление услуг в области добычи полезных ископаемых"],
        ["10", "Производство пищевых продуктов"],
        ["11", "Производство напитков"],
        ["12", "Производство табачных изделий"],
        ["13", "Производство текстильных изделий"],
        ["14", "Производство одежды"],
        ["15", "Производство кожи и изделий из кожи"],
        ["16", "Обработка древесины и производство изделий из дерева и пробки, кроме мебели, производство изделий из соломки и материалов для плетения"],
        ["17", "Производство бумаги и бумажных изделий"],
        ["18", "Деятельность полиграфическая и копирование носителей информации"],
        ["19", "Производство кокса и нефтепродуктов"],
        ["20", "Производство химических веществ и химических продуктов"],
        ["21", "Производство лекарственных средств и материалов, применяемых в медицинских целях"],
        ["22", "Производство резиновых и пластмассовых изделий"],
        ["23", "Производство прочей неметаллической минеральной продукции"],
        ["24", "Производство металлургическое"],
        ["25", "Производство готовых металлических изделий, кроме машин и оборудования"],
        ["26", "Производство компьютеров, электронных и оптических изделий"],
        ["27", "Производство электрического оборудования"],
        ["28", "Производство машин и оборудования, не включенных в другие группировки"],
        ["29", "Производство автотранспортных средств, прицепов и полуприцепов"],
        ["30", "Производство прочих транспортных средств и оборудования"],
        ["31", "Производство мебели"],
        ["32", "Производство прочих готовых изделий"],
        ["33", "Ремонт и монтаж машин и оборудования"],
        ["35", "Обеспечение электрической энергией, газом и паром; кондиционирование воздуха"],
        ["36", "Забор, очистка и распределение воды"],
        ["37", "Сбор и обработка сточных вод"],
        ["38", "Сбор, обработка и утилизация отходов; обработка вторичного сырья"],
        ["39", "Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов"],
        ["41", "Строительство зданий"],
        ["42", "Строительство инженерных сооружений"],
        ["43", "Работы строительные специализированные"],
        ["45", "Торговля оптовая и розничная автотранспортными средствами и мотоциклами и их ремонт"],
        ["46", "Торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами"],
        ["47", "Торговля розничная, кроме торговли автотранспортными средствами и мотоциклами"],
        ["49", "Деятельность сухопутного и трубопроводного транспорта"],
        ["50", "Деятельность водного транспорта"],
        ["51", "Деятельность воздушного и космического транспорта"],
        ["52", "Складское хозяйство и вспомогательная транспортная деятельность"],
        ["53", "Деятельность почтовой связи и курьерская деятельность"],
        ["55", "Деятельность по предоставлению мест для временного проживания"],
        ["56", "Деятельность по предоставлению продуктов питания и напитков"],
        ["58", "Деятельность издательская"],
        ["59", "Производство кинофильмов, видеофильмов и телевизионных программ, издание звукозаписей и нот"],
        ["60", "Деятельность в области телевизионного и радиовещания"],
        ["61", "Деятельность в сфере телекоммуникаций"],
        ["62", "Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги"],
        ["63", "Деятельность в области информационных технологий"],
        ["64", "Деятельность по предоставлению финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению"],
        ["65", "Страхование, перестрахование, деятельность негосударственных пенсионных фондов, кроме обязательного социального обеспечения"],
        ["66", "Деятельность вспомогательная в сфере финансовых услуг и страхования"],
        ["68", "Операции с недвижимым имуществом"],
        ["69", "Деятельность в области права и бухгалтерского учета"],
        ["70", "Деятельность головных офисов; консультирование по вопросам управления"],
        ["71", "Деятельность в области архитектуры и инженерно-технического проектирования; технических испытаний, исследований и анализа"],
        ["72", "Научные исследования и разработки"],
        ["73", "Деятельность рекламная и исследование конъюнктуры рынка"],
        ["74", "Деятельность профессиональная научная и техническая прочая"],
        ["75", "Деятельность ветеринарная"],
        ["77", "Аренда и лизинг"],
        ["78", "Деятельность по трудоустройству и подбору персонала"],
        ["79", "Деятельность туристических агентств и прочих организаций, предоставляющих услуги в сфере туризма"],
        ["80", "Деятельность по обеспечению безопасности и проведению расследований"],
        ["81", "Деятельность по обслуживанию зданий и территорий"],
        ["82", "Деятельность административно-хозяйственная, вспомогательная деятельность по обеспечению функционирования организации, деятельность по предоставлению прочих вспомогательных услуг для бизнеса"],
        ["84", "Деятельность органов государственного управления по обеспечению военной безопасности, обязательному социальному обеспечению"],
        ["85", "Образование"],
        ["86", "Деятельность в области здравоохранения"],
        ["87", "Деятельность по уходу с обеспечением проживания"],
        ["88", "Предоставление социальных услуг без обеспечения проживания"],
        ["90", "Деятельность творческая, деятельность в области искусства и организации развлечений"],
        ["91", "Деятельность библиотек, архивов, музеев и прочих объектов культуры"],
        ["92", "Деятельность по организации и проведению азартных игр и заключению пари, по организации и проведению лотерей"],
        ["93", "Деятельность в области спорта, отдыха и развлечений"],
        ["94", "Деятельность общественных организаций"],
        ["95", "Ремонт компьютеров, предметов личного потребления и хозяйственно-бытового назначения"],
        ["96", "Деятельность по предоставлению прочих персональных услуг"],
        ["97", "Деятельность домашних хозяйств с наемными работниками"],
        ["98", "Деятельность недифференцированная частных домашних хозяйств по производству товаров и предоставлению услуг для собственного потребления"],
        ["99", "Деятельность экстерриториальных организаций и органов"]
    ]
}
